Documents/БюджетГод.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>БюджетГод</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БДР</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйОстаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоПросмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБюджета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НедельноеПланирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьГашение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Детализация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяДР</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Comment>номер месяца</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/БюджетГод/Ext/ManagerModule.bsl
Процедура ПечатьДереваРекурсивно(СтрокиДерева, СекцияСтрока, ТабДок, СекцияСтрокаВерт)
	
	Для Каждого Стр Из СтрокиДерева Цикл
		СекцияСтрока.Параметры.СтатьяДР = Стр.СтатьяДР;
		Если Стр.ЭтоГруппа Тогда
			СекцияСтрока.ТекущаяОбласть.Шрифт = Новый Шрифт(,,Истина);
		Иначе	
			СекцияСтрока.ТекущаяОбласть.Шрифт = Новый Шрифт(,,Ложь);
		КонецЕсли;	
		ТабДок.Вывести(СекцияСтрока, Стр.Уровень());
		
		Для сч = 1 по 13 Цикл
			СекцияСтрокаВерт.Параметры.ПечПлан = Стр["План"+Строка(сч)];
			СекцияСтрокаВерт.Параметры.ПечФакт = Стр["Факт"+Строка(сч)];
			СекцияСтрокаВерт.Параметры.ПечВып = Стр["Рез"+Строка(сч)];
			
			ТабДок.Присоединить(СекцияСтрокаВерт);
		КонецЦикла;
		
		ПечатьДереваРекурсивно(Стр.Строки, СекцияСтрока, ТабДок, СекцияСтрокаВерт)
		
	КонецЦикла;
	
КонецПроцедуры

//вызывается из модуля формы документа (из серверной процедуры)
Процедура ПечатьБДРМоя(ТабДок, ПараметрКоманды) Экспорт

	Макет = Документы.БюджетГод.ПолучитьМакет("БДР");
	Ссылка = ПараметрКоманды.Ссылка;

	ДеревоБДРФорма = ОбщийМодуль1Сервер.СоздатьДеревоБДР();
	
	СтруктураПараметров = Новый Структура("ДеревоБДРФорма, Объект, НачальныйОстатокПлан, НачальныйОстатокФакт",
	ДеревоБДРФорма, Ссылка, Ссылка.НачальныйОстаток, Ссылка.НачальныйОстаток);
	
	ОбщийМодуль1Сервер.ЗаполнитьДеревоИзСправочникаСервер(СтруктураПараметров);
	
	//ОбщийМодуль1Сервер.ЗаполнитьДеревоБДРПриОткрытииСуществующегоДокументаСервер(Ссылка, ДеревоБДРФорма, Истина);
	
	//здесь у нас есть полностью заполненное и рассчитанное дерево
	
	Шапка = Макет.ПолучитьОбласть("Шапка|Начало");
	Шапка.Параметры.Заполнить(Ссылка);
	Загол = Макет.ПолучитьОбласть("Загол|Начало");
	СекцияСтрока = Макет.ПолучитьОбласть("Строка|Начало");
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	
	//Шапка.Параметры.Заполнить(Выборка);
	ТабДок.Вывести(Шапка);
	
	ТабДок.Вывести(Загол);
	
	ЗаголВерт = Макет.ПолучитьОбласть("Загол|Верт");
	Для сч = 1 по 12 Цикл
		ЗаголВерт.Параметры.Мес = ОбщийМодуль1Сервер.ИмяМесяцаПоНомеру(сч);
		ТабДок.Присоединить(ЗаголВерт);
	КонецЦикла;
	//итоги
	ЗаголВерт.Параметры.Мес = "ИТОГО";
	ТабДок.Присоединить(ЗаголВерт);
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ТабДок.НачатьАвтогруппировкуСтрок ();
	
	СтрокаВерт = Макет.ПолучитьОбласть("Строка|Верт");
	ПечатьДереваРекурсивно(ДеревоБДРФорма.Строки, СекцияСтрока, ТабДок, СтрокаВерт);
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок ();
	
КонецПроцедуры
